var double = "test";
var single = 'test'
console.log(double === single); // true

//========================================================

const multiline = `1行
2行
3行
`;
console.log(multiline);
// のようにバッククオートを使ったテンプレートレテラルでは改行することができる

//========================================================

const str = "this book is \"js-primer\""
console.log(str);
// 文字列リテラルと同じ文字を使いたい場合はバックスラッシュでエスケープ

//========================================================

const multiline2 = "1行\n2行\n3行";
console.log(multiline2);
// 特殊な文字はエスケープシーケンスとして書く必要がある

//========================================================